app/Controllers/EventController.php

SELECT *
FROM `users`
WHERE `users`.`user_id` = '4'
---
    public function view($id)
    {
        $eventModel = new EventModel();
        $eventMediaModel = new EventMediaModel();
        $userModel = new UserModel();
        $registrationModel = new EventRegistrationModel();

        $event = $eventModel->getEventWithLocation($id);
        $media = $eventMediaModel->getMediaByEvent($id);
        if (!$event) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Wydarzenie o ID $id nie zostało znalezione.");
        }

        $registration = false;
        $loggedIn = false;
        if (session()->get('loggedUser')) {
            $loggedIn = true;
            $userId = session()->get('loggedUser');
            $registration = $registrationModel->isUserRegistered($id, $userId);
        }


        $organizer = $userModel->find($event['created_by_user_id']);

INSERT INTO `eventregistrations` (`event_id`, `user_id`, `is_anonymous`, `created_at`) VALUES ('3', '5', 1, '2024-11-13 20:01:08')
---
    public function register($eventId)
    {
        $userId = session()->get('loggedUser');
        $registrationModel = new EventRegistrationModel();

        if ($registrationModel->isUserRegistered($eventId, $userId)) {
            return redirect()->back()->with('message', 'Już jesteś zapisany na to wydarzenie.');
        }

        $isAnonymous = $this->request->getPost('is_anonymous') ? 1 : 0;

        $registrationModel->insert([
            'event_id' => $eventId,
            'user_id' => $userId,
            'is_anonymous' => $isAnonymous,
            'created_at' => date('Y-m-d H:i:s')
        ]);

SELECT *
FROM `eventmedia`
WHERE `eventmedia`.`media_id` = '2'
SELECT *
FROM `events`
WHERE `events`.`event_id` = '2'
DELETE FROM `eventmedia`
WHERE `media_id` IN ('2')
---
    public function deleteMedia($mediaId)
    {
        $eventMediaModel = new EventMediaModel();
        $media = $eventMediaModel->find($mediaId);

        $eventModel = new EventModel();
        $event = $eventModel->find($media['event_id']);

        $userId = session()->get('loggedUser');
        if ($event['created_by_user_id'] != $userId) {
            return redirect()->back()->with('error', 'Nie masz uprawnień do usuwania zdjęć z tego wydarzenia.');
        }

        if ($media) {
            $filePath = ROOTPATH . 'public/' . $media['media_url'];
            if (file_exists($filePath)) {
                unlink($filePath);
            }

            $eventMediaModel->delete($mediaId);