app/Models/EventMediaModel.php

SELECT *
FROM `eventmedia`
WHERE `event_id` = '2'
---
    public function getMediaByEvent($eventId)
    {
        return $this->where('event_id', $eventId)->findAll();