app/Models/EventRegistrationModel.php

    public function isUserRegistered(int $eventId, int $userId)
    {
        return $this->where('event_id', $eventId)
            ->where('user_id', $userId)
            ->first();
---
SELECT *
FROM `eventregistrations`
WHERE `event_id` = 2
AND `user_id` = 4
 LIMIT 1

    public function getEventParticipants($eventId)
    {
        return $this->select('users.username, eventregistrations.is_anonymous')
            ->join('users', 'users.user_id = eventregistrations.user_id')
            ->where('eventregistrations.event_id', $eventId)
            ->findAll();
---
SELECT `users`.`username`, `eventregistrations`.`is_anonymous`
FROM `eventregistrations`
JOIN `users` ON `users`.`user_id` = `eventregistrations`.`user_id`
WHERE `eventregistrations`.`event_id` = '2'

    public function getRegisteredCount($eventId)
    {
        return $this->where('event_id', $eventId)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `eventregistrations`
WHERE `event_id` = '2'