app/Models/EventModel.php

    public function getEventsByUser(int $userId, int $perPage = 10)
    {
        return $this->where('created_by_user_id', $userId)
            ->paginate($perPage);
---
SELECT *
FROM `events`
WHERE `created_by_user_id` = 4
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `events`
WHERE `created_by_user_id` = 4

    public function getAllEvents($search = null, $perPage = 10)
    {
        // Dołączenie tabeli `locations`
        $this->join('locations', 'locations.location_id = events.location_id')
            ->select('events.*, locations.name as location_name, locations.address as location_address')
            ->select("CASE WHEN end_datetime < NOW() THEN 1 ELSE 0 END AS is_finished");

        // Dodanie warunków wyszukiwania, jeśli jest podane
        if ($search) {
            $this->groupStart()
                ->like('events.name', $search)
                ->orLike('events.description', $search)
                ->groupEnd();
        }

        // Zwracanie wyników z paginacją
        return $this->paginate($perPage);
---
SELECT *, CASE WHEN end_datetime < NOW() THEN 1 ELSE 0 END AS is_finished
FROM `events`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `events`

    public function getEventWithLocation($id)
    {
        return $this->join('locations', 'locations.location_id = events.location_id')
            ->select('events.*, locations.name as location_name, locations.address as location_address')
            ->where('events.event_id', $id)
            ->first();
---
SELECT `events`.*, `locations`.`name` as `location_name`, `locations`.`address` as `location_address`
FROM `events`
JOIN `locations` ON `locations`.`location_id` = `events`.`location_id`
WHERE `events`.`event_id` = '2'
 LIMIT 1