app/Models/UserModel.php

    public function findUserByEmail($email)
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'userTest1@user.com'
 LIMIT 1

    public function registerUser($data)
    {
        return $this->insert($data);
---
INSERT INTO `users` (`username`, `email`, `hashed_password`) VALUES ('adawdawd', 'awdawd@awdaw.d', '$2y$10$0svu3/JONvAe33..YGvs6.YRWT8XAKQfDW2rDKdHmWSxXdQGdK/oa')

    public function getLoggedInUser()
    {
        if (!session()->has('loggedUser')) return null;
        return $this->where('user_id', session()->get('loggedUser'))->first();
---
SELECT *
FROM `users`
WHERE `user_id` = '4'
 LIMIT 1

    public function updateUser($userId, $data)
    {
        return $this->update($userId, $data);
---
UPDATE `users` SET `username` = 'user2', `email` = 'user@user.com'
WHERE `users`.`user_id` IN ('4')